/************************************
 * Название	: EEPROM.h				*
 * Автор	: Malik					*
 * Версия	: beta					*
 * Дата 	: 27.07.2019 18:44:16	*
 ***********************************/

#ifndef EEPROM_H
#define EEPROM_H
//=============================== Prototypes API =================================
BYTE EEPROM_read(WORD Addr); //Подпрограмма чтения EEPROM
void EEPROM_write(WORD Addr, BYTE Data); //Подпрограмма записи в EEPROM
//================================================================================
#endif /*EEPROM_H*/