/************************************
 * Название	: main.h				*
 * Автор	: Malik					*
 * Версия	: alpha					*
 * Дата 	: 09.07.2015 12:43:51	*
  * Изменён	: 27.07.2019 18:44:16	*
 ***********************************/
#ifndef MAIN_H
#define MAIN_H
//=============================== Included files =================================
#include <standart.h>
#include <EEPROM.h>
#include <LCD.h>
#include <Keyboard.h>
//================================= Definition ===================================

//=============================== Prototypes API =================================
ISR (TIMER2_COMP_vect);
//=================================  Variables ===================================
BYTE control = 0; //Регистр управления
volatile BYTE time = 125; //Переменная задающая время
BYTE choice = 1; //Переменная выбора канала
BYTE setup[2] = {}; //Каналы управления
//================================================================================
#endif /* MAIN_H */