/********************************
* Название:	EEPROM.c			*
* Версия: beta					*
* Автор	: Malik					*
* Дата 	: 09.07.2015 12:43:51	*
* Изменён: 27.07.2019 18:44:16	*
********************************/
//Функции работы с энергонезависимой памятью EEPROM
//=============================== Included files =================================
#include <standart.h>
//===================================== API ======================================
BYTE EEPROM_read(WORD Addr) { //Подпрограмма чтения EEPROM
	while(EECR & (1<<EEWE));
	EEAR = Addr;
	EECR |= (1<<EERE);
	return EEDR;
} //==============================================================================
void EEPROM_write(WORD Addr, BYTE Data) { //Подпрограмма записи в EEPROM
	while(EECR & (1<<EEWE));
	EEAR = Addr;
	EEDR = Data;
	EECR |= (1<<EEMWE);
	EECR |= (1<<EEWE);
} //========================== Private functions =================================